Revit 2027 API
Document.SetDefaultElementTypeId Method
 Sets the default element type id of the given DefaultElementType id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetDefaultElementTypeId(
	ElementTypeGroup defaultTypeId,
	ElementId typeId
)
Public Sub SetDefaultElementTypeId (
	defaultTypeId As ElementTypeGroup,
	typeId As ElementId
)
public:
void SetDefaultElementTypeId(
	ElementTypeGroup defaultTypeId,
	ElementId^ typeId
)
member SetDefaultElementTypeId :
        defaultTypeId : ElementTypeGroup *
        typeId : ElementId -> unit
Parameters
defaultTypeId ElementTypeGroup
 The default element type id.
typeId ElementId
 The element type id.
Exceptions
Exception | Condition
ArgumentException |  The element type id typeId is invalid for the give DefaultElementType id defaultTypeId.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace